app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.all
---
SELECT "recipes".* FROM "recipes"

  def create
    @recipe = current_user.recipes.build(recipe_params)

    if @recipe.save
---
INSERT INTO "recipes" ("title", "cook_time", "difficulty", "created_at", "updated_at", "user_id") VALUES ('Lasaña', 120, 'Medium', '2025-10-13 20:00:12.993358', '2025-10-13 20:00:12.993358', 2) RETURNING "id"

  def update
    if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "updated_at" = '2025-10-13 20:00:13.019318' WHERE "recipes"."id" = 3

  def destroy
    @recipe.destroy
---
DELETE FROM "recipes" WHERE "recipes"."id" = 2

  def set_recipe
    @recipe = Recipe.find(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = 2 LIMIT 1